PR_postprocess_vectorize_tiled/e2e/Qwen3.5-9B/tiled_64_16_num_run2.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe280ac48d940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-d20920bd-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 16:39:17 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  193.63    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              2.58      
Output token throughput (tok/s):         13763.05  
Peak output token throughput (tok/s):    5952.00   
Peak concurrent requests:                115.00    
Total token throughput (tok/s):          15054.15  
---------------Time to First Token----------------
Mean TTFT (ms):                          267.59    
Median TTFT (ms):                        201.31    
P50 TTFT (ms):                           201.31    
P90 TTFT (ms):                           618.93    
P99 TTFT (ms):                           942.07    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.40      
Median TPOT (ms):                        4.12      
P50 TPOT (ms):                           4.12      
P90 TPOT (ms):                           6.20      
P99 TPOT (ms):                           6.46      
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.09     
Median ITL (ms):                         11.79     
P50 ITL (ms):                            11.79     
P90 ITL (ms):                            17.80     
P99 ITL (ms):                            55.87     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          23727.12  
Median E2EL (ms):                        22134.71  
P50 E2EL (ms):                           22134.71  
P90 E2EL (ms):                           33142.01  
P99 E2EL (ms):                           34613.96  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.65     
Acceptance length:                       2.97      
Drafts:                                  896441    
Draft tokens:                            1792882   
Accepted tokens:                         1768596   
Per-position acceptance (%):
  Position 0:                            99.29     
  Position 1:                            98.00     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfaab84fb1940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-eee3c28e-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 16:42:57 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  191.26    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              2.61      
Output token throughput (tok/s):         13934.05  
Peak output token throughput (tok/s):    5952.00   
Peak concurrent requests:                117.00    
Total token throughput (tok/s):          15241.19  
---------------Time to First Token----------------
Mean TTFT (ms):                          257.23    
Median TTFT (ms):                        212.71    
P50 TTFT (ms):                           212.71    
P90 TTFT (ms):                           533.19    
P99 TTFT (ms):                           757.56    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.38      
Median TPOT (ms):                        4.11      
P50 TPOT (ms):                           4.11      
P90 TPOT (ms):                           5.96      
P99 TPOT (ms):                           6.28      
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.00     
Median ITL (ms):                         11.78     
P50 ITL (ms):                            11.78     
P90 ITL (ms):                            17.39     
P99 ITL (ms):                            55.20     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          23587.96  
Median E2EL (ms):                        22066.79  
P50 E2EL (ms):                           22066.79  
P90 E2EL (ms):                           31847.40  
P99 E2EL (ms):                           33699.33  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.48     
Acceptance length:                       2.97      
Drafts:                                  897448    
Draft tokens:                            1794896   
Accepted tokens:                         1767597   
Per-position acceptance (%):
  Position 0:                            99.23     
  Position 1:                            97.73     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf1cf0d2a1940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-b67a4f9c-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 16:46:35 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  191.45    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              2.61      
Output token throughput (tok/s):         13919.73  
Peak output token throughput (tok/s):    5952.00   
Peak concurrent requests:                118.00    
Total token throughput (tok/s):          15225.52  
---------------Time to First Token----------------
Mean TTFT (ms):                          240.17    
Median TTFT (ms):                        213.64    
P50 TTFT (ms):                           213.64    
P90 TTFT (ms):                           509.69    
P99 TTFT (ms):                           733.46    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.37      
Median TPOT (ms):                        4.13      
P50 TPOT (ms):                           4.13      
P90 TPOT (ms):                           5.95      
P99 TPOT (ms):                           6.21      
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.00     
Median ITL (ms):                         11.78     
P50 ITL (ms):                            11.78     
P90 ITL (ms):                            17.25     
P99 ITL (ms):                            55.58     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          23551.19  
Median E2EL (ms):                        22138.74  
P50 E2EL (ms):                           22138.74  
P90 E2EL (ms):                           31810.78  
P99 E2EL (ms):                           33311.36  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.60     
Acceptance length:                       2.97      
Drafts:                                  896739    
Draft tokens:                            1793478   
Accepted tokens:                         1768299   
Per-position acceptance (%):
  Position 0:                            99.28     
  Position 1:                            97.92     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe5854b901940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-cbe48fc4-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 16:50:12 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  193.20    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              2.59      
Output token throughput (tok/s):         13793.80  
Peak output token throughput (tok/s):    5952.00   
Peak concurrent requests:                118.00    
Total token throughput (tok/s):          15087.77  
---------------Time to First Token----------------
Mean TTFT (ms):                          248.97    
Median TTFT (ms):                        205.09    
P50 TTFT (ms):                           205.09    
P90 TTFT (ms):                           490.82    
P99 TTFT (ms):                           723.04    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.40      
Median TPOT (ms):                        4.11      
P50 TPOT (ms):                           4.11      
P90 TPOT (ms):                           6.30      
P99 TPOT (ms):                           6.57      
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.09     
Median ITL (ms):                         11.84     
P50 ITL (ms):                            11.84     
P90 ITL (ms):                            17.92     
P99 ITL (ms):                            55.11     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          23708.86  
Median E2EL (ms):                        22038.14  
P50 E2EL (ms):                           22038.14  
P90 E2EL (ms):                           33685.14  
P99 E2EL (ms):                           35178.58  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.72     
Acceptance length:                       2.97      
Drafts:                                  896019    
Draft tokens:                            1792038   
Accepted tokens:                         1769021   
Per-position acceptance (%):
  Position 0:                            99.38     
  Position 1:                            98.05     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xefc28d7b1940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-7c4d52f8-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 16:53:52 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  192.82    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              2.59      
Output token throughput (tok/s):         13821.00  
Peak output token throughput (tok/s):    5960.00   
Peak concurrent requests:                118.00    
Total token throughput (tok/s):          15117.53  
---------------Time to First Token----------------
Mean TTFT (ms):                          240.88    
Median TTFT (ms):                        192.35    
P50 TTFT (ms):                           192.35    
P90 TTFT (ms):                           516.67    
P99 TTFT (ms):                           740.81    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.40      
Median TPOT (ms):                        4.10      
P50 TPOT (ms):                           4.10      
P90 TPOT (ms):                           6.21      
P99 TPOT (ms):                           6.46      
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.06     
Median ITL (ms):                         11.80     
P50 ITL (ms):                            11.80     
P90 ITL (ms):                            17.71     
P99 ITL (ms):                            55.58     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          23666.90  
Median E2EL (ms):                        22003.53  
P50 E2EL (ms):                           22003.53  
P90 E2EL (ms):                           33221.09  
P99 E2EL (ms):                           34625.75  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.53     
Acceptance length:                       2.97      
Drafts:                                  897150    
Draft tokens:                            1794300   
Accepted tokens:                         1767889   
Per-position acceptance (%):
  Position 0:                            99.24     
  Position 1:                            97.82     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe958a06ad940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-3f8cef1d-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 16:57:31 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  192.98    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              2.59      
Output token throughput (tok/s):         13809.67  
Peak output token throughput (tok/s):    5952.00   
Peak concurrent requests:                117.00    
Total token throughput (tok/s):          15105.13  
---------------Time to First Token----------------
Mean TTFT (ms):                          230.63    
Median TTFT (ms):                        186.35    
P50 TTFT (ms):                           186.35    
P90 TTFT (ms):                           440.31    
P99 TTFT (ms):                           683.94    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.40      
Median TPOT (ms):                        4.11      
P50 TPOT (ms):                           4.11      
P90 TPOT (ms):                           6.18      
P99 TPOT (ms):                           6.50      
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.08     
Median ITL (ms):                         11.78     
P50 ITL (ms):                            11.78     
P90 ITL (ms):                            17.87     
P99 ITL (ms):                            55.36     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          23702.89  
Median E2EL (ms):                        22105.49  
P50 E2EL (ms):                           22105.49  
P90 E2EL (ms):                           33025.65  
P99 E2EL (ms):                           34861.71  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.51     
Acceptance length:                       2.97      
Drafts:                                  897281    
Draft tokens:                            1794562   
Accepted tokens:                         1767766   
Per-position acceptance (%):
  Position 0:                            99.20     
  Position 1:                            97.81     
==================================================